from collections import Counter
# Выпишу комбинации для 5 кубиков
# 1,1,1,1,1  1200
# 6,6,6,6,6  720
# 5,5,5,5,5  600
# 4,4,4,4,4  480
# 3,3,3,3,3  360
# 2,2,2,2,2  240
#--
#--сумма выше (1200->1000)
# 1,1,1,1,x  300
# 6,6,6,6,x  180
# 5,5,5,5,x  150
# 4,4,4,4,x  120
# 3,3,3,3,x  90
# 2,2,2,2,x  60
#   5,5,x,1,1  30
#--- стоит ли менять выигрыш x на (2*x+15)/6? только если x < 15/4. Т.е. нет

# 1,1,1,x,x  100
# 6,6,6,x,x  60
# 5,5,5,x,x  50
# 4,4,4,x,x  40
# 3,3,3,x,x  30
# 2,2,2,x,x  20
#   5,x,1,1,x  25
#   1,x,5,5,x  20
#--- стоит ли менять выигрыш x (при выпадении комб.выше)?
# -- x на (8*x+90)/36? При x<90/28 (3.21). Т.е. не меняем

#5,5,x,x,x
#1,1,x,x,x
#5,1,x,x,x
#1,5,x,x,x
# -- стоит ли менять выигрыш x на (8*x+345+12*x+60*3+6*x+15*6)/216
# -- x на (26*x+615)/216? При x < 615/190 (3.23) Т.е. нет
#1,x,x,x,x
#5,x,x,x,x
cnt = 0
#cnt2=0
Val = 0
for i1 in range(1,7):
    for i2 in range(1,7):
        for i3 in range(1,7):
            for i4 in range(1,7):
                for i5 in range(1,7):
                    d = Counter(list([i1,i2,i3,i4,i5]))
                    #print(d)
                    if d[1]==5 or d[2]==5 or d[3]==5 or d[4]==5 or d[5]==5 or d[6]==5:
                        cnt+=1
                        if d[1]==5:
                            Val+=1000
                        if d[2]==5:
                            Val+=240
                        if d[3]==5:
                            Val+=360
                        if d[4]==5:
                            Val+=480
                        if d[5]==5:
                            Val+=600
                        if d[6]==5:
                            Val+=720
                    elif d[1]==4 or d[2]==4 or d[3]==4 or d[4]==4 or d[5]==4 or d[6]==4:
                        cnt+=1
                        #cnt2+=1
                        if d[1]==4:
                            Val+=300
                        if d[2]==4:
                            Val+=60
                        if d[3]==4:
                            Val+=90
                        if d[4]==4:
                            Val+=120
                        if d[5]==4:
                            Val+=150
                        if d[6]==4:
                            Val+=180
                    elif d[1]==3 or d[2]==3 or d[3]==3 or d[4]==3 or d[5]==3 or d[6]==3:
                        cnt+=1
                        #cnt2+=1
                        if d[1]==3:
                            Val+=100
                        if d[2]==3:
                            Val+=20
                        if d[3]==3:
                            Val+=30
                        if d[4]==3:
                            Val+=40
                        if d[5]==3:
                            Val+=50
                        if d[6]==3:
                            Val+=60
                    elif d[1]>0 or d[5]>0:
                        cnt+=1
                        Val += d[1]*10 + d[5]*5
                    else:
                        #print(str(i1)+str(i2)+str(i3)+str(i4)+str(i5))
                        pass
print(cnt)
print(6**5)
print(Val)
# 7176 - число комбинаций
# 7776 - общее число вариантов
# Val = 177400
# Мат. ожидание выигрыша с броска 5 камней
print('Мат.ожидание= ' +str(Val/7776))
#22.81
#Ответ: 20 








